perpendicular-flap/fluid-openfoam/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    // --- Convezione (Fluido) ---
    div(phi,U)      Gauss upwind;
    
    // --- Energia e Termodinamica (Comprimibile) ---
    div(phi,e)      Gauss upwind;      // Energia interna
    div(phi,h)      Gauss upwind;      // Entalpia (se usata)
    div(phi,K)      Gauss upwind;                    // Energia cinetica
    div(phiv,p)     Gauss linear;                    // Lavoro di pressione
    
    // --- Mesh Dinamica (Termini correttivi) ---
    div(meshPhi,p)  Gauss linear;

    // --- Turbolenza (k-Omega SST) ---
    div(phi,k)      Gauss upwind;
    div(phi,omega)  Gauss upwind;

    // --- Stress Viscosi (Termini diffusivi complessi) ---
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
